In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.232936 -1.484410
1    a  two  0.178452  0.757214
2    b  one  0.274280  0.244574
3    b  two -0.467942 -1.222171
4    a  one  1.707808  1.471479

In [4]:
df['data1'].groupby(df.key1).mean()

key1
a    0.706399
b   -0.096831
Name: data1, dtype: float64

In [7]:
means=df['data1'].groupby([df.key1,df.key2]).mean()

In [8]:
means.unstack()

key2       one       two
key1
a     0.970372  0.178452
b     0.274280 -0.467942

In [9]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.706399  0.248095
b    -0.096831 -0.488798

In [12]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.970372 -0.006465
     two   0.178452  0.757214
b    one   0.274280  0.244574
     two  -0.467942 -1.222171

In [13]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.345963 -0.556170
1    a  two -0.493114 -0.001258
2    b  one -0.406229  0.321124
3    b  two -0.575054 -0.187806
4    a  one  0.455109  1.498659

In [14]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.345963 -0.556170
1    a  two -0.493114 -0.001258
4    a  one  0.455109  1.498659
b
  key1 key2     data1     data2
2    b  one -0.406229  0.321124
3    b  two -0.575054 -0.187806

In [20]:
dic = dict([('a',1),('b',2),('c',3)])
dic['a']

1

In [23]:
dfDict=dict(list(df.groupby('key1')))
dfDict

{'a':   key1 key2     data1     data2
 0    a  one  1.345963 -0.556170
 1    a  two -0.493114 -0.001258
 4    a  one  0.455109  1.498659,
 'b':   key1 key2     data1     data2
 2    b  one -0.406229  0.321124
 3    b  two -0.575054 -0.187806}

In [24]:
dfDict['a']

  key1 key2     data1     data2
0    a  one  1.345963 -0.556170
1    a  two -0.493114 -0.001258
4    a  one  0.455109  1.498659

In [25]:
dfDict['b']

  key1 key2     data1     data2
2    b  one -0.406229  0.321124
3    b  two -0.575054 -0.187806

In [26]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.099118 -0.377457
1    a  two  0.922363  0.042819
2    b  one -0.807009 -0.014710
3    b  two  0.296984 -0.686604
4    a  one  0.911741  0.952948

In [27]:
df.groupby('key1')['data1'].mean()

key1
a    0.644408
b   -0.255013
Name: data1, dtype: float64

In [28]:
df.groupby('key1')[['data1']].mean()

         data1
key1
a     0.644408
b    -0.255013

In [29]:
df.groupby('key1')[['data1','data2']].mean()

         data1     data2
key1
a     0.644408  0.206103
b    -0.255013 -0.350657

In [30]:
df.groupby(['key1','key2'])[['data1','data2']].mean()

              data1     data2
key1 key2
a    one   0.505430  0.287746
     two   0.922363  0.042819
b    one  -0.807009 -0.014710
     two   0.296984 -0.686604

In [34]:
def peak_to_peak(x):
    return x.max() - x.min()

df.groupby(['key1'])[['data1','data2']].aggregate(peak_to_peak)

         data1     data2
key1
a     0.823245  1.330404
b     1.103993  0.671894